Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Causes the current thread to wait until either another thread invokes the notify() method or the notifyAll() method for this object, or a specified amount of time has elapsed.
zh_cn: 使当前线程等待，直到另一个线程对此对象调用 notify() 方法或 notifyAll() 方法，或已经过了指定的时间量。

source: Cells can span columns, as they can in HTML.
zh_cn: 单元格可以跨越列，就像它们可以在 HTML 中一样。

source: Cells must be added to a row in increasing column order, both in code and XML.
zh_cn: 必须以递增的列顺序将单元格添加到行中，包括代码和 XML。

source: Center the image in the view, but perform no scaling.
zh_cn: 使图像在 view 中居中，但不执行缩放。

source: Center the paragraph, e.g.
zh_cn: 将段落居中，例如。

source: Center widget between the other two widgets.
zh_cn: 将部件位于另两个部件的中心。

source: Centering positioning
zh_cn: 居中定位

source: Centering positioning and bias
zh_cn: 中心定位和偏心

source: Centers the view horizontally relative to toView's position.
zh_cn: 相对于 toView 的位置水平居中。

source: Centers the view vertically relative to toView's position.
zh_cn: 将 view 相对于 view 的位置垂直居中。

source: Centers the widget horizontally to the left and right side on another widgets sides.
zh_cn: 将部件放在另外的部件的左边和右边间中水平居中。

source: Centers the widgets Vertically to the top and bottom side on another widgets sides.
zh_cn: 将部件相对于另外部件的顶边和底边垂直居中。

source: Centers the widgets horizontally to the left and right side on another widgets sides.
zh_cn: 将部件相对于另外的 view 的左边和右边水平居中。

source: Chain Style
zh_cn: 链的样式

source: Chain heads
zh_cn: 链头

source: Chain packed style
zh_cn: 链包装样式

source: Chain spread inside style
zh_cn: 链内部展开样式

source: Chain spread style
zh_cn: 链展开样式

source: Chains
zh_cn: 链

source: Chains are controlled by attributes set on the first element of the chain (the "head" of the chain):
zh_cn: 链由在链的第一个元素(链的 "头")上设置的属性控制：

source: Chains provide group-like behavior in a single axis (horizontally or vertically).
zh_cn: 链在单个轴方向(水平或竖直)提供一组类似的行为。

source: Change the checked state of the view to the inverse of its current state
zh_cn: 将 view 的选中状态更改为其当前状态的相反状态

source: Change whether the shapes are filled, outlined, or both by calling setStyle().
zh_cn: 通过调用 setStyle() 来更改形状是否填充，轮廓或两者都有。

source: Check for cancelation.
zh_cn: 检查取消。

source: Check for interception.
zh_cn: 检查拦截。

source: Check if a given point in the CoordinatorLayout's coordinates are within the view bounds of the given direct child view.
zh_cn: 检查 CoordinatorLayout 坐标中的给定点是否在给定直接子 view 的 view 范围内。

source: Check if the RecyclerView is configured to clip child views to its padding.
zh_cn: 检查 RecyclerView 是否配置为将子 view 剪切到它的 padding。

source: Check whether the overflow menu is currently showing.
zh_cn: 检查溢出菜单当前是否显示。

source: Check whether this Toolbar is currently hosting an expanded action view.
zh_cn: 检查此工具栏当前是否包含展开的操作 view。

source: Check whether two views overlap each other.
zh_cn: 检查两个 view 是否相互重叠。

source: Checking one radio button that belongs to a radio group unchecks any previously checked radio button within the same group.
zh_cn: 选中一个属于单选组的单选按钮，会取消选中同一组中之前已选中的任何单选按钮。

source: Checking whether the return value matches the value of the inBitmap set in the Options structure will indicate if the bitmap was reused, but in all cases you should use the Bitmap returned by the decoding function to ensure that you are using the bitmap that was used as the decode destination.
zh_cn: 检查返回值是否与 Options 结构中设置的 inBitmap 的值相匹配，将指示位图是否被重用，但是在所有情况下，应使用解码函数返回的位图来确保你使用的位图用作解码目的地。

source: Checks if RecyclerView is in the middle of a layout or scroll and throws an IllegalStateException if it is not.
zh_cn: 检查 RecyclerView 是否处理布局或滚动中，如果 is not 则抛出 IllegalStateException 。

source: Checks if RecyclerView is in the middle of a layout or scroll and throws an IllegalStateException if it is.
zh_cn: 检查是否 RecyclerView 处理布局或滚动间，然后抛出 IllegalStateException 如果它 is。

source: Child is already receiving touch within its bounds.
zh_cn: 子项已经在它的范围内接受触摸了。

source: Child views are drawn in a stack, with the most recently added child on top.
zh_cn: 子 view 以堆栈形式绘制，最近添加的子项位于顶部。

source: Child views can opt to be pinned in space globally.
zh_cn: 子 view 可以选择在全局空间中固定。

source: Child views can opt to be scrolled within this layout in a parallax fashion.
zh_cn: 子 view 可以选择在 view 布局内以视差方式滚动。

source: Child views may overlap if their combined width exceeds the available width in the SlidingPaneLayout.
zh_cn: 如果组合宽度超过 SlidingPaneLayout 中的可用宽度，则子 view 可能会重叠。

source: Child wants to receive touch within its bounds.
zh_cn: 子项想在其范围内接收触摸。

source: Children can specify CoordinatorLayout.LayoutParams.insetEdge to describe how the view insets the CoordinatorLayout.
zh_cn: 子项们可以指定 CoordinatorLayout.LayoutParams.insetEdge 来描述 view 如何将 CoordinatorLayout 内缩内容。

source: Children can specify insetEdge to describe how the view insets the CoordinatorLayout.
zh_cn: Children 可以指定 insetEdge 来描述 view 如何将 CoordinatorLayout 内缩。

source: Children occupy one or more contiguous cells, as defined by their GridLayout.LayoutParams#rowSpec and GridLayout.LayoutParams#columnSpec layout parameters.
zh_cn: 子节点占用一个或多个连续单元格，由 GridLayout.LayoutParams#rowSpec 和 GridLayout.LayoutParams#columnSpec 布局参数定义。

source: Children of a CoordinatorLayout may have an anchor.
zh_cn: CoordinatorLayout 的子节点可能具有 anchor。

source: Children should provide their desired scrolling behavior through setScrollFlags(int) and the associated layout xml attribute: app:layout_scrollFlags.
zh_cn: children 应该通过 setScrollFlags(int) 和相关的布局 xml 属性：app:layout_scrollFlags 来提供他们想要的滚动行为。

source: ChipGroup also supports a multiple-exclusion scope for a set of chips.
zh_cn: ChipGroup 还支持一组 chip 的多选排除范围。

source: Chips are compact elements that represent an attribute, text, entity, or action.
zh_cn: Chip 是表示属性，文本，实体或动作的紧凑元素。

source: Choose the backing for the pixel memory.
zh_cn: 选择像素内存的支持。

source: Chooses a size from the given specs and parameters that is closest to the desired size and also complies with the spec.
zh_cn: 从指定的 specs 和参数中选中一个尺寸，它接近渴望的尺寸同时也遵从 spec。

source: Choosing the input type configures the keyboard type that is shown, acceptable characters, and appearance of the edit text.
zh_cn: 选择输入类型可配置显示的键盘类型，可接受的字符和编辑文本的外观。

source: Class Initialization
zh_cn: 类初始化

source: Class for accessing an application's resources.
zh_cn: 用于访问应用程序资源的类。

source: Class name of the Layout Manager to be used.
zh_cn: 所使用的 Layout Manager 的类名。

source: Class that implements a simple timer.
zh_cn: 实现简单计时器的类。

source: Classes
zh_cn: 类

source: Classes for matching character sequences against patterns specified by regular expressions.
zh_cn: （参考：http://www.oschina.net/uploads/doc/javase-6-doc-api-zh_CN/index.html?java/util/regex/package-summary.html）用正则表达式指定模式匹配字符序列的类。

source: Classes implementing this interface should create a final instance of a NestedScrollingChildHelper as a field and delegate any View methods to the NestedScrollingChildHelper methods of the same signature.
zh_cn: 实现此接口的类应该创建一个 NestedScrollingChildHelper 的 final 实例作为字段，并将任何 View 方法委托给相同签名的 NestedScrollingChildHelper 方法。

source: Classes implementing this interface should create a final instance of a NestedScrollingParentHelper as a field and delegate any View or ViewGroup methods to the NestedScrollingParentHelper methods of the same signature.
zh_cn: 实现此接口的类应该创建一个 NestedScrollingParentHelper 的 final 实例作为字段，并将任何 View 或 ViewGroup 方法委托给 NestedScrollingParentHelper 方法签名。

source: Classes that wish to be notified when the swipe gesture correctly triggers a refresh should implement this interface.
zh_cn: 希望在滑动手势正确触发刷新时通知的类应实现此接口。

source: Classes that wish to override SwipeRefreshLayout.canChildScrollUp() method behavior should implement this interface.
zh_cn: 希望重写 SwipeRefreshLayout.canChildScrollUp() 方法行为的类应该实现此接口。

source: Clean up after nested scrolls if this is the end of a gesture; also cancel it if we tried an ACTION_DOWN but we didn't want the rest of the gesture.
zh_cn: 如果这是一个手势的结尾，在嵌套的滚动之后进行清理；如果我们尝试了一个 ACTION_DOWN，但不希望看到其余的手势，也取消它。

source: Clean up earlier touch targets for this pointer id in case they have become out of sync.
zh_cn: 清除此指针 id 的早期触摸目标，以防它们不同步。

source: Clear any lines and curves from the path, making it empty.
zh_cn: 清除路径中的所有线条和曲线，使其变空。

source: Clearing text functionality via setEndIconMode(int) API and related attribute.
zh_cn: 通过 setEndIconMode(int) API 和相关属性清除文本功能。

source: Clears the span index cache.
zh_cn: 清除 span index 的缓存。

source: Click Finish.
zh_cn: 单击 Finish。

source: Click OK to begin the conversion.
zh_cn: 单击 OK 开始转换。

source: Click Yes to delete the original WebP file, or No to retain the WebP file in addition to the PNG file.
zh_cn: 单击 Yes 删除原始 WebP 文件，或者 No 除了 PNG 文件之外还保留 WebP 文件。

source: Click the view to select it.
zh_cn: 点击 view 选择它。

source: Client can optionally pass a payload for partial change.
zh_cn: 客户端可以选择传递部分更改的有效负载。

source: Clients have to call setChecked(boolean).
zh_cn: 客户端必须调用 setChecked(boolean)。

source: Clients of the SeekBar can attach a SeekBar.OnSeekBarChangeListener to be notified of the user's actions.
zh_cn: SeekBar 的客户端可以附加 SeekBar.OnSeekBarChangeListener 以通知用户的操作。

source: Close the current contour.
zh_cn: 闭合当前轮廓。

source: Closes this resource, relinquishing any underlying resources.
zh_cn: 关闭此资源，放弃任何底层资源。

source: Cold start
zh_cn: 冷启动（Cold start）

source: Cold starts happen in cases such as your app’s being launched for the first time since the device booted, or since the system killed the app.
zh_cn: 冷启动发生的情况，比如自设备启动以来或自系统终止应用程序以来，首次启动应用程序。

source: Collapse a currently expanded action view.
zh_cn: 折叠当前展开的操作 view。

source: Collapsing title
zh_cn: 折叠标题

source: CollapsingToolbarLayout contains the following features:
zh_cn: CollapsingToolbarLayout 包含以下功能：

source: CollapsingToolbarLayout is a wrapper for Toolbar which implements a collapsing app bar.
zh_cn: CollapsingToolbarLayout 是 Toolbar 的包装，它实现了折叠应用栏(collapsing app bar)。

source: Color used to draw a gesture.
zh_cn: 用于绘制手势的颜色。

source: Color used to draw the user's strokes until we are sure it's a gesture.
zh_cn: 用于绘制用户笔划的颜色，直到我们确定它是一个手势。

source: Colors are represented as packed ints, made up of 4 bytes: alpha, red, green, blue.
zh_cn: 颜色表示为打包的 int，由 4 个字节组成：alpha，red，green，blue。

source: Column numbers are zero-based.
zh_cn: 列号从零开始。

source: Complex custom views often need to perform multiple layout calculations depending on the size and shape of their area on screen.
zh_cn: 复杂的自定义 view 通常需要根据屏幕上区域的大小和形状执行多次布局计算。

source: Components registering observers with an adapter are responsible for #unregisterAdapterDataObserver(RecyclerView.AdapterDataObserver) unregistering those observers when finished.
zh_cn: 在适配器中注册观察者的组件负责在完成后 #unregisterAdapterDataObserver(RecyclerView.AdapterDataObserver) unregistering

source: Compositing equations
zh_cn: 合成方程

source: Compound Controls
zh_cn: 复合控制

source: Compress PNG and JPEG files
zh_cn: 压缩 PNG 和 JPEG 文件

source: Compute a scale that will maintain the original src aspect ratio, but will also ensure that src fits entirely inside dst.
zh_cn: 计算将保持原始 src 宽高比的比例，但也将确保 src 完全适合 dst。

source: Compute the bounds of the control points of the path, and write the answer into bounds.
zh_cn: 计算路径控制点的边界，并将答案写入边界。

source: Compute the horizontal extent of the horizontal scrollbar's thumb within the horizontal range.
zh_cn: 在水平范围中, 计算水平滚动条的水平范围。

source: Compute the horizontal offset of the horizontal scrollbar's thumb within the horizontal range.
zh_cn: 在水平范围中, 计算水平滚动条的水平偏移量。

source: Compute the horizontal range that the horizontal scrollbar represents.
zh_cn: 计算水平滚动条在水平方向上的表现范围。

source: Compute the vertical extent of the vertical scrollbar's thumb within the vertical range.
zh_cn: 在垂直范围内, 计算垂直滚动条翻越的范围。

source: Compute the vertical offset of the vertical scrollbar's thumb within the vertical range.
zh_cn: 在垂直范围中, 计算垂直滚动条的垂直偏移量。

source: Compute the vertical range that the vertical scrollbar represents.
zh_cn: 在垂直范围内计算垂直滚动条的表现范围。

source: Configure the scrolling touch slop for a specific use case.
zh_cn: 为特定用例配置滚动触摸斜率。

source: Conform to Android standards
zh_cn: 符合 Android 标准

source: Consider using id resources to uniquely identify item view types.
zh_cn: 考虑使用 id 资源来唯一地标识项的 view 类型。

source: Consider using other common navigation patterns instead.
zh_cn: 请考虑使用其他 common navigation patterns。

source: Constant for use with setScrollingTouchSlop(int).
zh_cn: 使用 setScrollingTouchSlop(int) 的常量。

source: Constants
zh_cn: 常量

source: Constrain the side of a view to the corresponding edge of the layout.
zh_cn: 将 view 的边约束为布局的相应边。

source: Constrain to a guideline
zh_cn: 参考线约束

source: Constrains the baseline of a child to the baseline of a target child (contains the target child id).
zh_cn: 约束 child 的基线为目标 child 的基线(包含目标 child 的 id)。

source: Constrains the bottom side of a child to the bottom side of a target child (contains the target child id).
zh_cn: 约束 child 的底边为目标 child 的底边(包含目标 child 的 id)。

source: Constrains the bottom side of a child to the top side of a target child (contains the target child id).
zh_cn: 约束 child 的底边为目标 child 的顶边(包含目标 child 的 id)。

source: Constrains the end side of a child to the end side of a target child (contains the target child id).
zh_cn: 约束 child 的 end 边为目标 child 的 end 边(包含目标 child 的 id)。

source: Constrains the end side of a child to the start side of a target child (contains the target child id).
zh_cn: 约束 child 的 end 边为目标 child 的 start 边(包含目标 child 的 id)。

source: Constrains the left side of a child to the left side of a target child (contains the target child id).
zh_cn: 约束 child 的左边为目标 child 的左边(包含目标 child 的 id)。

source: Constrains the left side of a child to the right side of a target child (contains the target child id).
zh_cn: 约束 child 的左边为目标 child 的右边(包含目标 child 的 id)。

source: Constrains the right side of a child to the left side of a target child (contains the target child id).
zh_cn: 约束 child 的右边为目标 child 的左边(包含目标 child 的 id)。

source: Constrains the right side of a child to the right side of a target child (contains the target child id).
zh_cn: 约束 child 的右边为目标 child 的右边(包含目标 child 的 id)。

source: Constrains the start side of a child to the end side of a target child (contains the target child id).
zh_cn: 约束 child 的 start 边为目标 child 的 end 边(包含目标 child 的 id)。

source: Constrains the start side of a child to the start side of a target child (contains the target child id).
zh_cn: 约束 child 的 start 边为目标 child 的 start 边(包含目标 child 的 id)。

source: Constrains the top side of a child to the bottom side of a target child (contains the target child id).
zh_cn: 约束 child 的顶边为目标 child 的底边(包含目标 child 的 id)。

source: Constrains the top side of a child to the top side of a target child (contains the target child id).
zh_cn: 约束 child 的顶边为目标 child 的顶边(包含目标 child 的 id)。

source: Constrains the views aspect ratio.
zh_cn: 约束 view 的宽高比。

source: Constraints overview
zh_cn: Constraints 概述

source: ConstraintsSet can be created in various ways:
zh_cn: ConstraintsSet 可以通地各种方式创建：

source: Construct a GestureDetector by passing in an instance of a class that implements GestureDetector.OnGestureListener.
zh_cn: 通过传入实现 GestureDetector.OnGestureListener 的类的实例来构造 GestureDetector。

source: Constructing a Source (with one of the overloads of createSource) can be done on any thread because the construction simply captures values.
zh_cn: 构造 Source(带有 createSource 的重载之一)可以在任何线程上完成，因为构造只是捕获值。

source: Constructors
zh_cn: 构造方法

source: Container for a tabbed window view.
zh_cn: 标签窗口 view 的容器。

source: Contains useful information about the current RecyclerView state like target scroll position or view focus.
zh_cn: 包含一些关于当前 RecyclerView 的状态的一些有用的信息，比如目标滚动位置，鼠标焦点等。

source: Content and code samples on this page are subject to the licenses described in the Content License.
zh_cn: 此页面上的内容和代码示例受 Content License 中描述的许可证的约束。

source: Content scrim
zh_cn: 内容 scrim

source: ContentLoadingProgressBar implements a ProgressBar that waits a minimum time to be dismissed before showing.
zh_cn: ContentLoadingProgressBar 实现了一个 ProgressBar，该 ProgressBar 在显示前等待最短时间被取消。

source: Contrast with Position.
zh_cn: 与 Position 形成对比。

source: Contributions to the Android platform that do not adhere to these rules are generally not accepted.
zh_cn: 对不遵守这些规则的 Android 平台的贡献一般是 not accepted。

source: Control linear groups with a chain
zh_cn: 用一个链控制线性组

source: Controls how the image should be resized or moved to match the size of this ImageView.
zh_cn: 控制如何调整图像大小或移动图像以匹配此 ImageView 的大小。

source: Controls the initial visibility of the view.
zh_cn: 控制 view 的初始可见性。

source: Controls the scrollbar style and position.
zh_cn: 控制滚动条样式和位置。

source: Controls whether a view can take focus.
zh_cn: 控制 view 是否可以获得焦点。

source: Controls whether the view's window should keep the screen on while visible.
zh_cn: 控制 view 的窗口是否应在可见时保持屏幕开启。

source: Convenience function to set the flag bits as specified in flags, as per setFlags(int, int).
zh_cn: 根据 setFlags(int, int) 设置 flags 中指定的标志位的便捷函数。

source: Convenience method to scroll to a certain position.
zh_cn: 便捷方法以滚动一定的位置。

source: Conversely, if its bottom 75% is visible then it will be scrolled fully into view.
zh_cn: 相反，如果它的底部 75％是可见的，那么它将完全滚动到 view 中。

source: Convert HSV components to an ARGB color.
zh_cn: 将 HSV 组件转换为 ARGB 颜色。

source: Convert RGB components to HSV.
zh_cn: 将 RGB 组件转换为 HSV。

source: Convert WebP images to PNG
zh_cn: 将 WebP 图像转换为 PNG

source: Convert a layout
zh_cn: 转换布局

source: Convert images to WebP
zh_cn: 将图像转换为 WebP

source: Convert the argb color to its HSV components.
zh_cn: 将 argb 颜色转换为其 HSV 组件。

source: CoordinatorLayout is a super-powered FrameLayout.
zh_cn: CoordinatorLayout 是一个超级强力的(super-powered) FrameLayout。

source: CoordinatorLayout is intended for two primary use cases:
zh_cn: CoordinatorLayout 用于两个主要用例：

source: Copy the constraints from a layout.
zh_cn: 从一个布局复制约束。

source: Copy the layout parameters of a ConstraintLayout.
zh_cn: 复制 ConstraintLayout 的布局参数。

source: Create Drawing Objects
zh_cn: 创建绘制对象

source: Create Physically Plausible Motion
zh_cn: 创建物理上合理的运动

source: Create WebP images
zh_cn: 创建 WebP 图像

source: Create a Bitmap from a Source.
zh_cn: 从 Source 创建 Bitmap。

source: Create a Drawable from a Source.
zh_cn: 从 Source 创建 Drawable。

source: Create a BitmapRegionDecoder from a file path.
zh_cn: 从文件路径创建 BitmapRegionDecoder。

source: Create a BitmapRegionDecoder from an input stream.
zh_cn: 从输入流创建 BitmapRegionDecoder。

source: Create a BitmapRegionDecoder from the file descriptor.
zh_cn: 从文件描述符创建 BitmapRegionDecoder。

source: Create a BitmapRegionDecoder from the specified byte array.
zh_cn: 从指定的字节数组创建一个 BitmapRegionDecoder。

source: Create a LayoutParams object suitable for this LayoutManager from an inflated layout resource.
zh_cn: 通过加载的布局资源创建一个适合该 LayoutManager 的 LayoutParams 对象。

source: Create a LayoutParams object suitable for this LayoutManager, copying relevant values from the supplied LayoutParams object if possible.
zh_cn: 创建一个适合该 LayoutManager 的 LayoutParams 对象。如果可能从提供的 LayoutParams 复制样关的参数。

source: Create a constraint between two widgets.
zh_cn: 在两个部件间创建约束。

source: Create a default LayoutParams object for a child of the RecyclerView.
zh_cn: 为该 RecyclerView 的一个子 view 创建一个默认的 LayoutParams 对象。

source: Create a default Options object, which if left unchanged will give the same result from the decoder as if null were passed.
zh_cn: 创建一个默认的 Options 对象，如果保持不变，将会给解码器提供相同的结果，就像 null 传递一样。

source: Create a new Source from a ByteBuffer.
zh_cn: 从 ByteBuffer 创建新的 Source。

source: Create a new Source from a File.
zh_cn: 从 File 创建新的 Source。

source: Create a new Source from a Uri.
zh_cn: 从 Uri 创建新的 Source。

source: Create a new Source from a file in the "assets" directory.
zh_cn: 从 "assets" 目录中的文件创建新的 Source。

source: Create a new Source from a resource.
zh_cn: 从资源创建新的 Source。

source: Create a new compose shader, given shaders A, B, and a combining PorterDuff mode.
zh_cn: 创建一个新的组合着色器，给定着色器 A，B 和组合 PorterDuff 模式。

source: Create a new compose shader, given shaders A, B, and a combining mode.
zh_cn: 创建一个新的组合着色器，给定着色器 A，B 和一个组合模式。

source: Create a new layout
zh_cn: 创建新的布局

source: Create a new path, copying the contents from the src path.
zh_cn: 创建一个新路径，从 src 路径复制内容。

source: Create a shader that draws a linear gradient along a line.
zh_cn: 创建一个绘制线性渐变的着色器。

source: Create a shader that draws a radial gradient given the center and radius.
zh_cn: 创建一个着色器，以给定中心和半径绘制径向渐变。

source: Create an empty path
zh_cn: 创建一个空路径

source: Create an xfermode that uses the specified porter-duff mode.
zh_cn: 创建一个使用指定的 porter-duff 模式的 xfermode。

source: Create and initialize the activity.
zh_cn: 创建并初始化 activity。

source: Create the page for the given position.
zh_cn: 创建给定位置的页面。

source: Creates Bitmap objects from various sources, including files, streams, and byte-arrays.
zh_cn: 从各种来源创建位图对象，包括文件，流和字节数组。

source: Creates a ConstraintLayout virtual object.
zh_cn: 创建一个 ConstraintLayout 虚拟对象。

source: Creates a new SparseArray containing no mappings that will not require any additional memory allocation to store the specified number of mappings.
zh_cn: 创建不包含映射的新 SparseArray，该 SparseArray 不需要任何额外内存分配来存储指定数量的映射。

source: Creates a new SparseArray containing no mappings.
zh_cn: 创建不包含映射的新 SparseArray。

source: Creates a new bitmap, scaled from an existing bitmap, when possible.
zh_cn: 创建一个新的位图，如果可能，从现有的位图缩放。

source: Creates an image that the system displays during the drag and drop operation.
zh_cn: 创建系统在拖放操作期间显示的图像。

source: Creates and returns a copy of this object.
zh_cn: 创建并返回此对象的副本。

source: Creates views in a ViewSwitcher.
zh_cn: 在 ViewSwitcher 中创建 view。

source: Creating a chain
zh_cn: 创建链

source: Creating drawing objects within your onDraw() method significantly reduces performance and can make your UI appear sluggish.
zh_cn: 在 onDraw() 方法中创建绘图对象会显着降低性能并使 UI 显得缓慢。

source: Creating objects ahead of time is an important optimization.
zh_cn: 提前创建对象是一项重要的优化。

source: Creating the app process.
zh_cn: 创建应用 process（进程）.

source: Creating the app object.
zh_cn: 创建应用程序对象。

source: Creating the main activity.
zh_cn: 创建主 activity。

source: Creating your own View subclasses gives you precise control over the appearance and function of a screen element.
zh_cn: 创建你自己的 View 子类可提供对一个屏幕单元外观和功能的精细控制。

source: Creation
zh_cn: 创建

source: Crop the output to subset of the (possibly) scaled image.
zh_cn: 将输出裁剪为(可能)缩放图像的 subset。

source: Crunch PNG files
zh_cn: 紧缩 PNG 文件

source: Currently only the JPEG and PNG formats are supported.
zh_cn: 目前仅支持 JPEG 和 PNG 格式。

source: Currently the field only affects JPEG decode, in the case of which a more accurate, but slightly slower, IDCT method will be used instead.
zh_cn: 目前该字段只影响 JPEG 解码，在这种情况下，将使用更精确但速度稍慢的 IDCT 方法。

source: Currently you have no control over this shrinking -- if you set a capacity and then remove an item, it may reduce the capacity to better match the current size.
zh_cn: 目前，你无法控制这种缩小 -- 如果设置了容量，然后移除了某个项，则可能会减少容量，以更好地匹配当前大小。

source: Currently, the Guideline object allows you to create Horizontal and Vertical guidelines which are positioned relative to the ConstraintLayout container.
zh_cn: 目前 Guideline 对象允许你创建相对于 ConstraintLayout 容器定位的水平和竖直 guideline。

source: Custom Components
zh_cn: 自定义组件

source: Custom Drawing
zh_cn: 自定义绘制

source: Custom drawing can be easy or complex according to your application's needs.
zh_cn: 根据你的应用需求，可以轻松或复杂地自定义绘制。

source: Custom views should also support event listeners to communicate important events.
zh_cn: 自定义 view 还应支持事件侦听器来传递重要事件。

source: Decode a file path into a bitmap.
zh_cn: 将文件解码为位图。

source: Decodes a rectangle region in the image specified by rect.
zh_cn: 解码由 rect 指定的图像中的矩形区域。

source: Decoding will start from buffer.position().
zh_cn: 解码将从 buffer.position() 开始。

source: Default Cell Assignment
zh_cn: 默认单元格分配

source: Default constructor for inflating Behaviors from layout.
zh_cn: 用于从布局中扩展行为的默认构造函数。

source: Default constructor for instantiating Behaviors.
zh_cn: 用于实例化行为的默认构造函数。

source: Default for the root view.
zh_cn: 根 view 的默认值。
